Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.DistanceTextManipulator
The Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.DistanceTextManipulator class defines a manipulator to display and manipulate distance value text.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.DistanceTextManipulator.#ctor(Tekla.Structures.Plugins.DirectManipulation.Core.ManipulationContext,Tekla.Structures.Geometry3d.LineSegment,System.Double)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.DistanceTextManipulator class.
manipulationContext: The manipulation context.
placement: The placement of the text manipulator.
initialValue: The initial value.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.DistanceTextManipulator.DistanceEntered
Invoked when a distance has been entered.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.DistanceTextManipulator.Value
Gets or sets the value of the distance.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.DistanceTextManipulator.AttachHandlers


Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.DistanceTextManipulator.DetachHandlers


Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.DistanceTextManipulator.OnDistanceEntered(System.Object,System.Double)
Event handler for the distance entered event.
sender: The sender object.
eventArgs: The event arguments.